bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
static void rom_hook_probe(core_61::RomCommandHookContext& context, void* user_data) {
  RomHookProbe* const probe = (RomHookProbe*) user_data;
  probe->calls++;
  probe->last_address = context.address;
  probe->last_replacement = context.replacement_address;
  probe->arrays_present = context.r != nullptr && context.st != nullptr;
  if(probe->replace) context.replacement_address = probe->replacement;
}

static void command_hook_probe(
    core_61::Mk61CommandHookContext& context, void* user_data) {
  CommandHookProbe* const probe = (CommandHookProbe*) user_data;
  probe->calls++;
  probe->last_phase = context.phase;
  probe->last_source = context.source;
  probe->last_opcode = context.opcode;
  probe->last_replacement = context.replacement_opcode;
  probe->last_sequence = context.sequence;
  if(probe->order_log != nullptr && probe->order_count != nullptr) {
    probe->order_log[(*probe->order_count)++] = probe->order_tag;
  }
  if(probe->try_nested_registration) {
    probe->nested_registration = core_61::register_mk61_command_hook(
        0x00, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
        &command_hook_probe, probe);
  }
  if(context.phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE && probe->replace) {
    context.replacement_opcode = probe->replacement;
  }
  if(context.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE && probe->override_x) {
    // bcd_value следует порядку цифр в последовательном кольце (сначала младшая
    // цифра дисплея), поэтому 4.2424242 кодируется как 0x24242424.
    const core_61::bcd_value replacement_x = {0x24242424U, 0};
    core_61::set_stack_register(stack::X, &replacement_x);
  }
}

static void press_matrix(MatrixKey key) {
  core_61::clear_displayed();
  for(int i = 0; i < 4; i++) {
    MK61Emu_SetKeyPress(key.x, key.y);
    core_61::step();
    if(core_61::is_RUN()) break;
  }
  MK61Emu_SetKeyPress(0, 0);
  for(int i = 0; i < 512; i++) {
    core_61::step();
    if(core_61::is_RUN() || core_61::is_displayed()) break;
  }
}

// Повторяет hidden_press_key() из calculator_control.cpp, которая рассчитывает на очистку
// эмулируемой матрицы в core_61::step(), а не на вызов SetKeyPress(0, 0).
static void press_matrix_without_explicit_release(MatrixKey key) {
  core_61::clear_displayed();
  for(int i = 0; i < 4; i++) {
    MK61Emu_SetKeyPress(key.x, key.y);
    core_61::step();
    if(core_61::is_RUN()) break;
  }
  for(int i = 0; i < 64; i++) {
    core_61::step();
    if(core_61::is_RUN() || core_61::is_displayed()) break;
  }
  core_61::clear_displayed();
}

static MatrixKey digit_key(u8 digit) {
  return {(int) digit + 2, 1};
}

static void set_x_bcd(u32 mantissa, u16 signs_and_pow = 0) {
  const core_61::bcd_value value = {mantissa, signs_and_pow};
  core_61::set_stack_register(stack::X, &value);
}

static void store_direct(u8 reg, u32 mantissa) {
  set_x_bcd(mantissa);
  press_matrix({6, 9}); // X->P
  press_matrix(digit_key(reg));
}

static void set_register_integer(u8 reg, u32 value) {
  // R_A..R_F have no single decimal key in the matrix. Seed the public ring
  // layout directly so the same indirect-opcode test covers all 16 registers.
  const usize base = (usize) reg * MK61_MEMORY_PAGE_TETRADES;
  u8 exponent = 0;
  u32 leading = value;
  while(leading >= 10U) { leading /= 10U; exponent++; }
  u8 digits[8] = {};
  for(int index = exponent; index >= 0; --index) {
    digits[index] = (u8) (value % 10U);
    value /= 10U;
  }
  for(u8 index = 0; index < 8; ++index)
    ringM[base + 21U - (usize) index * 3U] = digits[index];
  ringM[base + 24U] = 0;
  ringM[base + 27U] = exponent % 10U;
  ringM[base + 30U] = exponent / 10U;
  ringM[base + 33U] = 0;
}

static double read_register_decimal(u8 reg) {
  char value[15] = {};
  MK61Emu_ReadRegister(reg, value, SYMBOLS);
  const int exponent = (value[12] - '0') * 10 + (value[13] - '0');
  return std::strtod(value, nullptr) *
      std::pow(10.0, value[11] == '-' ? -exponent : exponent);
}

static void prepare_indirect_registers(void) {
  core_61::enable();
  store_direct(5, 0x11111111U);
  store_direct(6, 0x22222222U);
  store_direct(7, 0x00000005U);
  store_direct(8, 0x00000006U);
}

static void press_kip7(void) {
  press_matrix({10, 9}); // K
  press_matrix({8, 9});  // P->X
  press_matrix(digit_key(7));
}

static void run_program(const u8* code, usize length) {
  u8 page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  for(usize i = 0; i < length && i < core_61::program_steps(); i++) page[i] = code[i];
  core_61::set_code_page(page);
  core_61::set_IP(0);
  press_matrix({2, 9}); // C/P
  for(int i = 0; i < 256 && core_61::is_RUN(); i++) core_61::step();
}

static constexpr usize MS_PROGRAM_BYTE_HIGH_TETRADES[
    MK61_PROGRAM_STEPS_PER_PAGE] = {41, 5, 11, 17, 23, 29, 35};

static usize ring_lane_tetrade(usize page, usize lane, usize tetrade) {
  return page * MK61_MEMORY_PAGE_TETRADES + lane + tetrade * 3U;
}

static void set_ms_program_byte(usize address, u8 opcode) {
  const usize page = address / MK61_PROGRAM_STEPS_PER_PAGE;
  const usize slot = address % MK61_PROGRAM_STEPS_PER_PAGE;
  const usize high = page * MK61_MEMORY_PAGE_TETRADES +
      MS_PROGRAM_BYTE_HIGH_TETRADES[slot] - 1U;
  ringM[high] = opcode >> 4;
  ringM[high - 3U] = opcode & 0x0FU;
}

static u8 get_ms_program_byte(usize address) {
  const usize page = address / MK61_PROGRAM_STEPS_PER_PAGE;
  const usize slot = address % MK61_PROGRAM_STEPS_PER_PAGE;
  const usize high = page * MK61_MEMORY_PAGE_TETRADES +
      MS_PROGRAM_BYTE_HIGH_TETRADES[slot] - 1U;
  return (u8) ((ringM[high] << 4) | ringM[high - 3U]);
}

static void press_k_digit(u8 digit) {
  press_matrix({10, 9}); // K
  press_matrix(digit_key(digit));
}

static void test_ms_exchange_commands(void) {
  std::printf("expanded Ms exchange commands 55/56:\n");
  core_61::configure_random_seed(false, 1);
  check_true("expanded Ms has nine pages",
      MK61_EXPANDED_MS_PAGES == 9 &&
      MK61_EXPANDED_MS_PROGRAM_STEPS == 63);

