bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  // 55 / K 1: nine complete numeric words are exchanged between M1
  // (R0..R8) and M2 (Ms).  The two non-numeric tetras in every page and the
  // remaining registers/program must not be touched.
  core_61::set_expanded_program_mode(true);
  core_61::enable();
  u8 code_before[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize address = 0; address < core_61::program_steps(); address++)
    code_before[address] = (u8) (address % 10U);
  core_61::set_code_page(code_before);

  u8 data_before[16][14] = {};
  u8 ms_before[MK61_EXPANDED_MS_PAGES][14] = {};
  for(usize page = 0; page < 16; page++) {
    for(usize tetrade = 0; tetrade < 14; tetrade++) {
      data_before[page][tetrade] =
          (u8) ((page * 3U + tetrade + 1U) % 10U);
      ringM[ring_lane_tetrade(page, 0, tetrade)] =
          data_before[page][tetrade];
      if(page < MK61_EXPANDED_MS_PAGES) {
        ms_before[page][tetrade] =
            (u8) ((page * 7U + tetrade + 4U) % 10U);
        ringM[ring_lane_tetrade(page, 1, tetrade)] =
            ms_before[page][tetrade];
      }
    }
  }

  CommandHookProbe data_after = {};
  const core_61::Mk61CommandHookHandle data_after_handle =
      core_61::register_mk61_command_hook(
          0x55, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &data_after);
  check_true("55 AFTER hook registered",
      data_after_handle != core_61::INVALID_MK61_COMMAND_HOOK);
  press_k_digit(1); // K PV / K 1

  bool numeric_words_swapped = true;
  bool service_tetrades_untouched = true;
  bool later_registers_untouched = true;
  for(usize page = 0; page < MK61_EXPANDED_MS_PAGES; page++) {
    for(usize tetrade = 0; tetrade < 12; tetrade++) {
      numeric_words_swapped &=
          ringM[ring_lane_tetrade(page, 0, tetrade)] ==
              ms_before[page][tetrade] &&
          ringM[ring_lane_tetrade(page, 1, tetrade)] ==
              data_before[page][tetrade];
    }
    for(usize tetrade = 12; tetrade < 14; tetrade++) {
      service_tetrades_untouched &=
          ringM[ring_lane_tetrade(page, 0, tetrade)] ==
              data_before[page][tetrade] &&
          ringM[ring_lane_tetrade(page, 1, tetrade)] ==
              ms_before[page][tetrade];
    }
  }
  for(usize page = MK61_EXPANDED_MS_PAGES; page < 16; page++) {
    for(usize tetrade = 0; tetrade < 14; tetrade++) {
      later_registers_untouched &=
          ringM[ring_lane_tetrade(page, 0, tetrade)] ==
              data_before[page][tetrade];
    }
  }
  u8 code_after[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  core_61::get_code_page(code_after);
  check_true("55 swaps R0..R8 with nine Ms words", numeric_words_swapped);
  check_true("55 preserves page service tetras", service_tetrades_untouched);
  check_true("55 preserves R9..RF", later_registers_untouched);
  check_true("55 preserves program",
      std::memcmp(code_before, code_after,
                  MK61_EXPANDED_PROGRAM_STEPS) == 0);
  check_true("55 hook reports keyboard command",
      data_after.calls == 1 &&
      data_after.last_source == core_61::Mk61CommandSource::KEYBOARD &&
      data_after.last_opcode == 0x55 &&
      data_after.last_replacement == 0x55);

  press_k_digit(1);
  bool data_exchange_reversed = true;
  for(usize page = 0; page < MK61_EXPANDED_MS_PAGES; page++) {
    for(usize tetrade = 0; tetrade < 14; tetrade++) {
      data_exchange_reversed &=
          ringM[ring_lane_tetrade(page, 0, tetrade)] ==
              data_before[page][tetrade] &&
          ringM[ring_lane_tetrade(page, 1, tetrade)] ==
              ms_before[page][tetrade];
    }
  }
  check_true("55 is reversible", data_exchange_reversed);
  check_true("55 AFTER fires once per exchange", data_after.calls == 2);
  check_true("remove 55 AFTER hook",
      core_61::unregister_mk61_command_hook(data_after_handle));

  // 56 / K 2: all seven bytes of each Ms page participate.  Run 56 from
  // address 00 itself; address 01 must then be fetched from the newly active
  // bank, proving that the swap occurs on the command boundary.
  core_61::enable();
  u8 active_program[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  u8 hidden_program[MK61_EXPANDED_MS_PROGRAM_STEPS] = {};
  for(usize address = 0; address < core_61::program_steps(); address++)
    active_program[address] = (u8) (address % 10U);
  active_program[0] = 0x56;
  active_program[1] = 0x01;
  active_program[70] = 0x50;
  core_61::set_code_page(active_program);
  for(usize address = 0; address < MK61_EXPANDED_MS_PROGRAM_STEPS;
      address++) {
    hidden_program[address] =
        (u8) ((((address + 3U) % 10U) << 4) |
              ((address + 7U) % 10U));
    set_ms_program_byte(address, hidden_program[address]);
  }
  hidden_program[1] = 0x50;
  set_ms_program_byte(1, hidden_program[1]);

  CommandHookProbe program_after = {};
  const core_61::Mk61CommandHookHandle program_after_handle =
      core_61::register_mk61_command_hook(
          0x56, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &program_after);
  check_true("56 AFTER hook registered",
      program_after_handle != core_61::INVALID_MK61_COMMAND_HOOK);
  ProgramBoundaryProbe boundary = {};
  check_true("56 boundary probe installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &boundary));
  core_61::set_IP(0);
  press_matrix({2, 9}); // C/P
  for(int i = 0; i < 512 && core_61::is_RUN(); i++) core_61::step();
  check_true("56 program finishes from exchanged bank", core_61::is_CALC());
  check_true("56 next fetch uses exchanged bank",
      boundary.calls >= 2 && boundary.addresses[0] == 0 &&
      boundary.opcodes[0] == 0x56 && boundary.addresses[1] == 1 &&
      boundary.opcodes[1] == 0x50);
  core_61::clear_mk61_program_boundary_hook();

  core_61::get_code_page(code_after);
  bool program_bank_swapped = true;
  bool hidden_bank_swapped = true;
  for(usize address = 0; address < MK61_EXPANDED_MS_PROGRAM_STEPS;
      address++) {
    program_bank_swapped &= code_after[address] == hidden_program[address];
    hidden_bank_swapped &= get_ms_program_byte(address) ==
        active_program[address];
  }
  check_true("56 swaps first 63 program steps", program_bank_swapped);
  check_true("56 moves old program into Ms", hidden_bank_swapped);
  check_true("56 preserves steps 63..111",
      std::memcmp(code_after + MK61_EXPANDED_MS_PROGRAM_STEPS,
                  active_program + MK61_EXPANDED_MS_PROGRAM_STEPS,
                  MK61_EXPANDED_PROGRAM_STEPS -
                      MK61_EXPANDED_MS_PROGRAM_STEPS) == 0);
  check_true("56 hook reports program command",
      program_after.calls == 1 &&
      program_after.last_source == core_61::Mk61CommandSource::PROGRAM &&
      program_after.last_opcode == 0x56 &&
      program_after.last_replacement == 0x56);

  press_k_digit(2); // K OD / K 2
  core_61::get_code_page(code_after);
  bool program_exchange_reversed =
      std::memcmp(code_after, active_program,
                  MK61_EXPANDED_PROGRAM_STEPS) == 0;
  bool hidden_exchange_reversed = true;
  for(usize address = 0; address < MK61_EXPANDED_MS_PROGRAM_STEPS;
      address++) {
    hidden_exchange_reversed &=
        get_ms_program_byte(address) == hidden_program[address];
  }
  check_true("56 is reversible", program_exchange_reversed &&
      hidden_exchange_reversed);
  check_true("56 hook reports keyboard command",
      program_after.calls == 2 &&
      program_after.last_source == core_61::Mk61CommandSource::KEYBOARD);
  check_true("remove 56 AFTER hook",
      core_61::unregister_mk61_command_hook(program_after_handle));

  // The extension is deliberately opt-in: a serial/classic 105-step core
  // retains the authentic inert behavior for both opcodes.
  core_61::set_expanded_program_mode(false);
  core_61::enable();
  u8 classic_program[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize address = 0; address < core_61::program_steps(); address++)
    classic_program[address] = (u8) (address % 10U);
  classic_program[0] = 0x56;
  classic_program[1] = 0x50;
  u8 classic_data[8][12] = {};
  u8 classic_ms_data[8][12] = {};
  u8 classic_ms_program[56] = {};
  for(usize page = 0; page < 8; page++) {
    for(usize tetrade = 0; tetrade < 12; tetrade++) {
      classic_data[page][tetrade] =
          (u8) ((page + tetrade + 2U) % 10U);
      classic_ms_data[page][tetrade] =
          (u8) ((page * 2U + tetrade + 5U) % 10U);
      ringM[ring_lane_tetrade(page, 0, tetrade)] =
          classic_data[page][tetrade];
      ringM[ring_lane_tetrade(page, 1, tetrade)] =
          classic_ms_data[page][tetrade];
    }
  }
  press_k_digit(1);
  bool classic_55_inert = true;
  for(usize page = 0; page < 8; page++) {
    for(usize tetrade = 0; tetrade < 12; tetrade++) {
      classic_55_inert &=
          ringM[ring_lane_tetrade(page, 0, tetrade)] ==
              classic_data[page][tetrade] &&
          ringM[ring_lane_tetrade(page, 1, tetrade)] ==
              classic_ms_data[page][tetrade];
    }
  }
  check_true("classic 55 remains inert", classic_55_inert);

  core_61::enable();
  core_61::set_code_page(classic_program);
  for(usize address = 0; address < 56; address++) {
    classic_ms_program[address] =
        (u8) ((((address + 1U) % 10U) << 4) |
              ((address + 6U) % 10U));
    set_ms_program_byte(address, classic_ms_program[address]);
  }
  core_61::set_IP(0);
  press_matrix({2, 9});
  for(int i = 0; i < 256 && core_61::is_RUN(); i++) core_61::step();
  core_61::get_code_page(code_after);
  bool classic_56_inert =
      std::memcmp(code_after, classic_program,
                  MK61_CLASSIC_PROGRAM_STEPS) == 0;
  for(usize address = 0; address < 56; address++) {
    classic_56_inert &=
        get_ms_program_byte(address) == classic_ms_program[address];
  }
  check_true("classic 56 remains inert", classic_56_inert);
}

static void test_mk61_command_lengths(void) {
  static const u8 with_operand[] = {
      0x51, 0x53, 0x57, 0x58, 0x59, 0x5A, 0x5B, 0x5C, 0x5D, 0x5E
  };
  bool all_match = true;
  for(unsigned opcode = 0; opcode < 256; ++opcode) {
    usize expected = 1;
    for(u8 entry : with_operand) if(opcode == entry) expected = 2;
    if(core_61::len_code_command((u8) opcode) != expected) {
      std::fprintf(stderr, "  FAIL opcode %02X: wrong instruction length\n", opcode);
      all_match = false;
    }
  }
  check_true("all 256 MK-61 instruction lengths", all_match);
}

static void test_mk61_command_hooks(void) {
  std::printf("MK-61 user command hook registry:\n");
  core_61::configure_random_seed(false, 1);
  check_true("command registry empty",
      core_61::registered_mk61_command_hook_count() == 0);

  prepare_indirect_registers();
  int order[4] = {};
  int order_count = 0;
  CommandHookProbe replacer = {};
  replacer.replace = true;
  replacer.replacement = 0xD8;
  replacer.try_nested_registration = true;
  replacer.order_tag = 1;
  replacer.order_log = order;
  replacer.order_count = &order_count;
  CommandHookProbe observer = {};
  observer.order_tag = 2;
  observer.order_log = order;
  observer.order_count = &order_count;
  CommandHookProbe after = {};
  CommandHookProbe replacement_target = {};

  const core_61::Mk61CommandHookHandle replace_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &replacer);
  const core_61::Mk61CommandHookHandle observe_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &observer);
  const core_61::Mk61CommandHookHandle after_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &after);
  const core_61::Mk61CommandHookHandle replacement_target_handle =
      core_61::register_mk61_command_hook(
          0xD8, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &replacement_target);
  check_true("four command hooks registered",
      replace_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      observe_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      after_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      replacement_target_handle != core_61::INVALID_MK61_COMMAND_HOOK &&
      core_61::registered_mk61_command_hook_count() == 4);

  const u8 indirect_program[] = {0xD7, 0x50};
  run_program(indirect_program, sizeof(indirect_program));
  check_near("program D7->D8", read_live_x(), 2.2222222, 1e-8);
  check_true("program BEFORE source/opcode",
      replacer.calls == 1 &&
      replacer.last_phase == core_61::Mk61CommandHookPhase::BEFORE_EXECUTE &&
      replacer.last_source == core_61::Mk61CommandSource::PROGRAM &&
      replacer.last_opcode == 0xD7);
  check_true("same-opcode registration order",
      order_count == 2 && order[0] == 1 && order[1] == 2 &&
      observer.last_replacement == 0xD8);
  check_true("replacement not redispatched",
      replacement_target.calls == 0);
  check_true("program AFTER result point",
      after.calls == 1 &&
      after.last_phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE &&
      after.last_source == core_61::Mk61CommandSource::PROGRAM &&
      after.last_opcode == 0xD7 && after.last_replacement == 0xD8 &&
      after.last_sequence == replacer.last_sequence);
  check_true("nested registration rejected",
      replacer.nested_registration == core_61::INVALID_MK61_COMMAND_HOOK);

  check_true("remove program replacer",
      core_61::unregister_mk61_command_hook(replace_handle));
  check_true("reject stale command handle",
      !core_61::unregister_mk61_command_hook(replace_handle));
  check_true("remove program observer",
      core_61::unregister_mk61_command_hook(observe_handle));
  check_true("remove program after",
      core_61::unregister_mk61_command_hook(after_handle));
  check_true("remove replacement target",
      core_61::unregister_mk61_command_hook(replacement_target_handle));

  prepare_indirect_registers();
  CommandHookProbe keyboard_before = {};
  keyboard_before.replace = true;
  keyboard_before.replacement = 0xD8;
  CommandHookProbe keyboard_after = {};
  const core_61::Mk61CommandHookHandle keyboard_before_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &keyboard_before);
  const core_61::Mk61CommandHookHandle keyboard_after_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &keyboard_after);
  press_kip7();
  check_near("keyboard D7->D8", read_live_x(), 2.2222222, 1e-8);
  check_true("keyboard BEFORE source",
      keyboard_before.calls == 1 &&
      keyboard_before.last_source == core_61::Mk61CommandSource::KEYBOARD);
  check_true("keyboard AFTER source/result",
      keyboard_after.calls == 1 &&
      keyboard_after.last_source == core_61::Mk61CommandSource::KEYBOARD &&
      keyboard_after.last_replacement == 0xD8 &&
      keyboard_after.last_sequence == keyboard_before.last_sequence);
  check_true("remove keyboard BEFORE",
      core_61::unregister_mk61_command_hook(keyboard_before_handle));
  check_true("remove keyboard AFTER",
      core_61::unregister_mk61_command_hook(keyboard_after_handle));

  prepare_indirect_registers();
  CommandHookProbe override = {};
  override.override_x = true;
  const core_61::Mk61CommandHookHandle override_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &override);
  press_kip7();
  check_near("AFTER KIP7 overrides X", read_live_x(), 4.2424242, 1e-8);
  check_true("KIP7 AFTER called once", override.calls == 1);
  prepare_indirect_registers();
  run_program(indirect_program, sizeof(indirect_program));
  check_near("program AFTER KIP7 overrides X", read_live_x(), 4.2424242, 1e-8);
  check_true("program KIP7 AFTER called once", override.calls == 2);
  check_true("remove KIP7 override",
      core_61::unregister_mk61_command_hook(override_handle));
  press_matrix({8, 9});
  press_matrix(digit_key(5));
  check_near("KIP7 override keeps R5", read_live_x(), 1.1111111, 1e-8);
  press_matrix({8, 9});
  press_matrix(digit_key(7));
  check_near("KIP7 override keeps R7", read_live_x(), 5.0, 1e-8);

  prepare_indirect_registers();
  CommandHookProbe no_release = {};
  const core_61::Mk61CommandHookHandle no_release_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &no_release);
  press_matrix_without_explicit_release({10, 9});
  press_matrix_without_explicit_release({8, 9});
  press_matrix_without_explicit_release(digit_key(7));
  check_true("keyboard AFTER without explicit release", no_release.calls == 1);
  check_true("remove no-release hook",
      core_61::unregister_mk61_command_hook(no_release_handle));

  CommandHookProbe one = {};
  CommandHookProbe two = {};
  CommandHookProbe stop = {};
  const core_61::Mk61CommandHookHandle one_handle =
      core_61::register_mk61_command_hook(
          0x01, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &one);
  const core_61::Mk61CommandHookHandle two_handle =
      core_61::register_mk61_command_hook(
          0x02, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &two);
  const core_61::Mk61CommandHookHandle stop_handle =
      core_61::register_mk61_command_hook(
          0x50, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
          &command_hook_probe, &stop);
  const u8 consecutive_program[] = {0x01, 0x02, 0x50};
  run_program(consecutive_program, sizeof(consecutive_program));
  check_true("several opcodes intercepted",
      one.calls == 1 && two.calls == 1 && stop.calls == 1);
  check_true("consecutive command sequences",
      one.last_sequence < two.last_sequence && two.last_sequence < stop.last_sequence);
  check_true("remove opcode 01", core_61::unregister_mk61_command_hook(one_handle));
  check_true("remove opcode 02", core_61::unregister_mk61_command_hook(two_handle));
  check_true("remove opcode 50", core_61::unregister_mk61_command_hook(stop_handle));

  core_61::configure_random_seed(true, 1234567);
  CommandHookProbe capacity_probes[core_61::MK61_COMMAND_HOOK_CAPACITY] = {};
  core_61::Mk61CommandHookHandle capacity_hooks[core_61::MK61_COMMAND_HOOK_CAPACITY] = {};
  bool capacity_ok = true;
  for(usize i = 0; i < core_61::MK61_COMMAND_HOOK_CAPACITY; i++) {
    capacity_hooks[i] = core_61::register_mk61_command_hook(
        (u8) i, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
        &command_hook_probe, &capacity_probes[i]);
    capacity_ok &= capacity_hooks[i] != core_61::INVALID_MK61_COMMAND_HOOK;
  }
  check_true("public command-hook capacity", capacity_ok);
  const core_61::Mk61CommandHookHandle overflow =
      core_61::register_mk61_command_hook(
          0xFF, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &capacity_probes[0]);
  check_true("command-hook capacity enforced",
      overflow == core_61::INVALID_MK61_COMMAND_HOOK);
  check_true("RNG command hook has reserved slot",
      core_61::random_seed_enabled() &&
      core_61::registered_mk61_command_hook_count() ==
          core_61::MK61_COMMAND_HOOK_CAPACITY);
  core_61::configure_random_seed(false, 1);
  for(core_61::Mk61CommandHookHandle handle : capacity_hooks) {
    check_true("command capacity unregister",
        core_61::unregister_mk61_command_hook(handle));
  }
  check_true("command registry cleanup",
      core_61::registered_mk61_command_hook_count() == 0);
}

static void test_rom_command_hooks(void) {
  std::printf("ROM command hook registry:\n");
  core_61::configure_random_seed(false, 1);
  check_true("hook registry empty", core_61::registered_rom_command_hook_count() == 0);

  // Используем адрес команды IK1306 с тем же словом ПЗУ, что и по адресу 00.
  // Так тест проверяет настоящую подстановку, не меняя поведение сброса.
  u8 ik1306_alias = 0;
  const u32 command_00 = core_61::rom_command_instruction(core_61::RomChip::IK1306, 0);
  for(u16 address = 1; address <= 0xFF; address++) {
    if(core_61::rom_command_instruction(core_61::RomChip::IK1306, (u8) address) == command_00) {
      ik1306_alias = (u8) address;
      break;
    }
  }
  check_true("ROM alias found", ik1306_alias != 0);

  RomHookProbe ik1302 = {};
  RomHookProbe ik1303 = {};
  RomHookProbe replacer = {};
  replacer.replace = true;
  replacer.replacement = ik1306_alias;
  RomHookProbe observer = {};

  const core_61::RomCommandHookHandle hook_1302 = core_61::register_rom_command_hook(
      core_61::RomChip::IK1302, 0, &rom_hook_probe, &ik1302);
  const core_61::RomCommandHookHandle hook_1303 = core_61::register_rom_command_hook(
      core_61::RomChip::IK1303, 0, &rom_hook_probe, &ik1303);
  const core_61::RomCommandHookHandle hook_replace = core_61::register_rom_command_hook(
      core_61::RomChip::IK1306, 0, &rom_hook_probe, &replacer);
  const core_61::RomCommandHookHandle hook_observe = core_61::register_rom_command_hook(
      core_61::RomChip::IK1306, 0, &rom_hook_probe, &observer);

  check_true("four hooks registered",
      hook_1302 != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_1303 != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_replace != core_61::INVALID_ROM_COMMAND_HOOK &&
      hook_observe != core_61::INVALID_ROM_COMMAND_HOOK &&
      core_61::registered_rom_command_hook_count() == 4);

  core_61::enable();
  check_true("different commands fire", ik1302.calls > 0 && ik1303.calls > 0);
  check_true("same command chains", replacer.calls > 0 && observer.calls > 0);
  check_true("registration order", observer.last_replacement == ik1306_alias);
  check_true("hook context arrays",
      ik1302.arrays_present && ik1303.arrays_present &&
      replacer.arrays_present && observer.arrays_present);
  check_true("original address stable",
      replacer.last_address == 0 && observer.last_address == 0);

  check_true("unregister one", core_61::unregister_rom_command_hook(hook_1302));
  check_true("reject stale handle", !core_61::unregister_rom_command_hook(hook_1302));
  ik1302.calls = 0;
  ik1303.calls = 0;
  core_61::enable();
  check_true("removed hook stays off", ik1302.calls == 0);
  check_true("other hook stays on", ik1303.calls > 0);

  check_true("remove IK1303", core_61::unregister_rom_command_hook(hook_1303));
  check_true("remove replacer", core_61::unregister_rom_command_hook(hook_replace));
  check_true("remove observer", core_61::unregister_rom_command_hook(hook_observe));
  check_true("registry empty again", core_61::registered_rom_command_hook_count() == 0);

