bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  RomHookProbe capacity_probes[core_61::ROM_COMMAND_HOOK_CAPACITY] = {};
  core_61::RomCommandHookHandle capacity_hooks[core_61::ROM_COMMAND_HOOK_CAPACITY] = {};
  bool capacity_ok = true;
  for(usize i = 0; i < core_61::ROM_COMMAND_HOOK_CAPACITY; i++) {
    capacity_hooks[i] = core_61::register_rom_command_hook(
        core_61::RomChip::IK1302, (u8) i, &rom_hook_probe, &capacity_probes[i]);
    capacity_ok &= capacity_hooks[i] != core_61::INVALID_ROM_COMMAND_HOOK;
  }
  check_true("public hook capacity", capacity_ok);
  const core_61::RomCommandHookHandle overflow = core_61::register_rom_command_hook(
      core_61::RomChip::IK1303, 0, &rom_hook_probe, &ik1303);
  check_true("capacity enforced", overflow == core_61::INVALID_ROM_COMMAND_HOOK);
  core_61::configure_random_seed(true, 1234567);
  check_true("RNG reserved slot", core_61::random_seed_enabled() &&
      core_61::registered_rom_command_hook_count() == core_61::ROM_COMMAND_HOOK_CAPACITY);
  core_61::configure_random_seed(false, 1);
  for(core_61::RomCommandHookHandle handle : capacity_hooks) {
    check_true("capacity unregister", core_61::unregister_rom_command_hook(handle));
  }
  check_true("capacity cleanup", core_61::registered_rom_command_hook_count() == 0);
}

static void test_pure_helpers(void) {
  std::printf("pure helpers vs <math.h>:\n");
  const double xs[] = {3.14, -3.14, 2.5, -2.5, 0.0, 7.0, -7.0, 123.456, -0.001};
  for(double x : xs) {
    check_near("floor", mk_math::floor(x), std::floor(x), 1e-12);
    check_near("ceil", mk_math::ceil(x), std::ceil(x), 1e-12);
    check_near("trunc", mk_math::trunc(x), std::trunc(x), 1e-12);
    check_near("fabs", mk_math::fabs(x), std::fabs(x), 1e-12);
  }
  check_near("pow10_int+3", mk_math::pow10_int(3), 1000.0, 1e-12);
  check_near("pow10_int-2", mk_math::pow10_int(-2), 0.01, 1e-12);
  check_true("pow10_int max", mk_math::is_inf(mk_math::pow10_int(INT_MAX)));
  check_true("pow10_int min", mk_math::pow10_int(INT_MIN) == 0.0);
  check_true("log10_floor 100", mk_math::log10_floor(100.0) == 2);
  check_true("log10_floor 0.01", mk_math::log10_floor(0.01) == -2);
  check_true("log10_floor 5", mk_math::log10_floor(5.0) == 0);
  check_true("log10_floor 0.5", mk_math::log10_floor(0.5) == -1);

  const char* endp = nullptr;
  check_near("atof int", mk_math::atof("123"), 123.0, 1e-9);
  check_near("atof frac", mk_math::atof("3.14159"), 3.14159, 1e-9);
  check_near("atof sci", mk_math::atof("-1.5e3"), -1500.0, 1e-9);
  check_near("atof huge int", mk_math::atof("123456789012345678901"), 1.2345678901234568e20, 1e-15);
  check_near("atof leading 0", mk_math::atof("0.00000000000000000000125"), 1.25e-21, 1e-15);
  check_true("atof equivalent register one",
             mk_math::atof("1.0000000e+00") == mk_math::atof("1"));
  check_true("atof equivalent register fraction",
             mk_math::atof("0.1000000e+00") == mk_math::atof("0.1"));
  check_true("atof equivalent register eighty",
             mk_math::atof("8.0000000e+01") == mk_math::atof("80"));
  check_true("atof overflow", mk_math::is_inf(mk_math::atof("1e999999")));
  check_true("atof underflow", mk_math::atof("1e-999999") == 0.0);
  check_true("atof zero huge", mk_math::atof("0e999999") == 0.0);
  double v = mk_math::strtod("42.5abc", &endp);
  check_near("strtod value", v, 42.5, 1e-9);
  check_true("strtod endptr", endp != nullptr && *endp == 'a');
  check_true("trunc NaN", mk_math::is_nan(mk_math::trunc(__builtin_nan(""))));
  check_true("floor +Inf", mk_math::is_inf(mk_math::floor(__builtin_huge_val())));
  check_true("pow10 subnormal", mk_math::pow10_int(-309) > 0.0);
  check_true("log10 invalid", mk_math::log10_floor(0.0) == 0);

  const char* huge_end = nullptr;
  const double huge = mk_math::strtod("1e999999999999999999999", &huge_end);
  check_true("strtod huge", std::isinf(huge));
  check_true("strtod huge end", huge_end != nullptr && *huge_end == 0);
  check_true("strtod zero huge", mk_math::atof("0e999999999999999999999") == 0.0);
  check_true("strtod denormal", mk_math::atof("4.940656458e-324") == std::numeric_limits<double>::denorm_min());
  check_near("strtod 20 digits", mk_math::strtod("12345678901234567890", nullptr), 1.2345678901234567e19, 1e-15);
  check_near("strtod long fraction", mk_math::atof("0.1234567890123456789012345"),
             0.12345678901234568, 1e-15);
}

static void test_transcendental(void) {
  std::printf("CORE transcendental vs libm (tol 1e-6):\n");
  const double tol = 1e-6;

  // The Flash-only test build does not run the SRAM-cache test which happens
  // to initialize the calculator.  Keep this test independent from build
  // options: eval_unary() deliberately refuses to snapshot an uninitialized
  // core whose internal table/ring pointers are still null.
  core_61::enable();

  check_near("sin(1)",   mk_math::sin(1.0),   std::sin(1.0),   tol);
  check_near("sin(-0.7)",mk_math::sin(-0.7),  std::sin(-0.7),  tol);
  check_near("cos(1)",   mk_math::cos(1.0),   std::cos(1.0),   tol);
  check_near("cos(2)",   mk_math::cos(2.0),   std::cos(2.0),   tol);
  check_near("tan(0.5)", mk_math::tan(0.5),   std::tan(0.5),   tol);
  check_near("asin(.5)", mk_math::asin(0.5),  std::asin(0.5),  tol);
  check_near("acos(.5)", mk_math::acos(0.5),  std::acos(0.5),  tol);
  check_near("atan(.5)", mk_math::atan(0.5),  std::atan(0.5),  tol);
  check_near("ln(2)",    mk_math::ln(2.0),    std::log(2.0),   tol);
  check_near("ln(10)",   mk_math::ln(10.0),   std::log(10.0),  tol);
  check_near("log10(100)",mk_math::log10(100.0), std::log10(100.0), tol);
  check_near("exp(1)",   mk_math::exp(1.0),   std::exp(1.0),   tol);
  check_near("exp(-2)",  mk_math::exp(-2.0),  std::exp(-2.0),  tol);
  check_near("sqrt(2)",  mk_math::sqrt(2.0),  std::sqrt(2.0),  tol);
  check_near("sqrt(1024)",mk_math::sqrt(1024.0), 32.0,         tol);

  check_near("pow(2,10)", mk_math::pow(2.0, 10.0), 1024.0,      tol);
  check_near("pow(1.5,3)",mk_math::pow(1.5, 3.0),  std::pow(1.5, 3.0), tol);
  check_near("pow(4,0.5)",mk_math::pow(4.0, 0.5),  2.0,         tol);
  check_near("pow(x,0)",  mk_math::pow(7.0, 0.0),  1.0,         tol);
  check_near("pow(-2,3)", mk_math::pow(-2.0, 3.0), -8.0,        tol);

