bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
static void test_far_condition_writeback(void) {
  std::printf("far conditions immediately after arithmetic:\n");
  static const struct { u8 size; u8 bytes[10]; } expressions[] = {
      {5,{0,0x0E,1,9,0x11}},       // 0-19: sign is late at prefix prefetch
      {6,{1,9,0x0E,1,9,0x11}},    // zero after subtraction
      {5,{1,9,0x0E,0,0x11}},      // positive subtraction
      {6,{0,0x0E,1,9,0x11,0x0B}}, // sign change
      {6,{0,0x0E,1,9,0x11,0x31}}, // absolute value
      {5,{2,0x0B,0x0E,3,0x12}},   // negative product
      {4,{2,0x0E,3,0x13}},        // fractional quotient
      {4,{0,0x0A,9,0x34}},        // integer part becomes zero
      {3,{1,9,0x22}},             // square
      {3,{8,1,0x21}},             // square root
  };
  static const u8 conditions[]={0x57,0x59,0x5C,0x5E};
  static const u8 indirect[]={0x77,0x97,0xC7,0xE7};
  bool correct=true;
  for(const auto& expression:expressions) {
    for(usize condition=0;condition<4;condition++) {
      char expected[5][15]={};
      core_61::set_expanded_program_mode(true);core_61::enable();
      core_61::clear_extended_program_banks();
      u8 code[72];std::memset(code,0x50,sizeof(code));
      std::memcpy(code,expression.bytes,expression.size);
      code[expression.size]=conditions[condition];
      code[expression.size+1]=0x70;
      run_program(code,sizeof(code));
      const bool taken=core_61::get_IP()==71;
      for(int reg=0;reg<5;reg++)read_stack_register((stack)reg,expected[reg],SYMBOLS);
      for(bool use_indirect:{false,true}) {
        core_61::enable();core_61::clear_extended_program_banks();
        set_register_integer(7,250);
        core_61::write_absolute_program(250,0x50);
        std::memset(code,0x50,sizeof(code));
        std::memcpy(code,expression.bytes,expression.size);
        code[expression.size]=0x1F;
        code[expression.size+1]=use_indirect?indirect[condition]:conditions[condition];
        if(!use_indirect)code[expression.size+2]=0x02;
        run_program(code,sizeof(code));
        bool equal=core_61::is_CALC() && !core_61::extended_program_error() &&
            core_61::active_program_bank()==(taken?2:0);
        for(int reg=0;reg<5;reg++) {
          char actual[15]={};read_stack_register((stack)reg,actual,SYMBOLS);
          equal=equal && std::memcmp(actual,expected[reg],15)==0;
        }
        if(!equal)std::printf("  expression=%lu condition=%02X indirect=%d bank=%u X=%.8g\n",
            (unsigned long)(&expression-expressions),conditions[condition],use_indirect,
            core_61::active_program_bank(),read_live_x());
        correct=correct&&equal;
      }
    }
  }
  check_true("80 direct/indirect arithmetic predicates match native ROM and full stack",correct);
}

static void test_extended_prefixes(void) {
  std::printf("expanded far-address and display prefixes:\n");
  static const u8 prefixes[] = {0x1FU, 0x2FU};
  for(u8 prefix : prefixes) {
    core_61::set_expanded_program_mode(false);
    core_61::enable();
    const u8 classic[] = {prefix, 0x07, 0x50};
    run_program(classic, sizeof(classic));
    check_near("classic prefix remains ROM command", read_live_x(), 7.0, 1e-8);
    check_true("classic prefix does not select bank",
        core_61::active_program_bank() == 0 &&
        !core_61::extended_program_error());
  }
  static const u8 native_conditions[] = {0x57, 0x59, 0x5C, 0x5E};
  for(u8 opcode : native_conditions) {
    for(u8 index = 0; index < 3; ++index) {
      core_61::set_expanded_program_mode(false);
      core_61::enable();
      if(index == 2) {
        char minus_one[8] = {'1','0','0','0','0','0','0','0'};
        write_stack_register(stack::X, '-', minus_one, 0);
      } else {
        press_matrix(digit_key(index));
      }
      const u8 native_condition[] = {opcode, 0x04, 0x07, 0x50, 0x08, 0x50};
      run_program(native_condition, sizeof(native_condition));
      const bool native_branches = core_61::get_IP() == 6;
      check_true("native condition reference",
          core_61::is_CALC() &&
          (native_branches || core_61::get_IP() == 4));

      core_61::set_expanded_program_mode(true);
      core_61::enable();
      core_61::clear_extended_program_banks();
      if(index == 2) {
        char minus_one[8] = {'1','0','0','0','0','0','0','0'};
        write_stack_register(stack::X, '-', minus_one, 0);
      } else {
        press_matrix(digit_key(index));
      }
      check_true("write far condition target",
          core_61::write_absolute_program(250, 0x50));
      const u8 far_condition[] = {0x1F, opcode, 0x02, 0x50, 0x50};
      run_program(far_condition, sizeof(far_condition));
      check_true("far condition matches ROM",
          core_61::active_program_bank() == (native_branches ? 2U : 0U) &&
          !core_61::extended_program_error());
    }
  }
  static const struct { u8 opcode; u8 reg; } loop_commands[] = {
      {0x58, 2}, {0x5A, 3}, {0x5B, 1}, {0x5D, 0}};
  for(const auto& loop : loop_commands) {
    for(u8 value = 1; value <= 3; ++value) {
      core_61::set_expanded_program_mode(false);
      core_61::enable();
      store_direct(loop.reg, value);
      const u8 native_loop[] = {loop.opcode, 0x04, 0x07, 0x50, 0x08, 0x50};
      run_program(native_loop, sizeof(native_loop));
      const bool native_branches = core_61::get_IP() == 6;
      core_61::set_expanded_program_mode(true);
      core_61::enable();
      core_61::clear_extended_program_banks();
      store_direct(loop.reg, value);
      check_true("write far loop target",
          core_61::write_absolute_program(250, 0x50));
      const u8 far_loop[] = {0x1F, loop.opcode, 0x02, 0x50, 0x50};
      run_program(far_loop, sizeof(far_loop));
      char reg[15] = {};
      MK61Emu_ReadRegister(loop.reg, reg, SYMBOLS);
      check_true("far FL0..FL3 matches ROM branch",
          core_61::active_program_bank() == (native_branches ? 2U : 0U) &&
          !core_61::extended_program_error());
      check_true("far FL0..FL3 counter value",
          reg[1] == (char) ('0' + (value == 1 ? 1 : value - 1)) &&
          reg[12] == '0' && reg[13] == '0');
    }
  }
  core_61::set_expanded_program_mode(true);
  core_61::enable();
  core_61::clear_extended_program_banks();
  store_direct(0, 0);
  const u8 zero_loop[] = {0x1F, 0x5D, 0x02, 0x50, 0x50};
  run_program(zero_loop, sizeof(zero_loop));
  check_true("far FL0 zero counter is rejected",
      core_61::is_CALC() && core_61::extended_program_error());
  core_61::set_expanded_program_mode(true);
  static const u8 prefix_operands[] = {0x1FU, 0x2FU};
  for(u8 operand : prefix_operands) {
    core_61::enable();
    core_61::clear_extended_program_banks();
    const u8 target = operand == 0x1FU ? 25U : 35U;
    ProgramBoundaryProbe probe = {};
    check_true("operand boundary hook installed",
        core_61::set_mk61_program_boundary_hook(
            &program_boundary_probe, &probe));
    u8 branch_with_prefix_operand[37] = {};
    for(u8& code : branch_with_prefix_operand) code = 0x50;
    branch_with_prefix_operand[0] = 0x51;
    branch_with_prefix_operand[1] = operand;
    branch_with_prefix_operand[target] = 0x07;
    run_program(branch_with_prefix_operand, sizeof(branch_with_prefix_operand));
    check_true("1F/2F operand is not an opcode",
        probe.calls == 3 &&
        probe.addresses[0] == 0 && probe.opcodes[0] == 0x51 &&
        probe.addresses[1] == target && probe.opcodes[1] == 0x07 &&
        probe.addresses[2] == target + 1U && probe.opcodes[2] == 0x50 &&
        !core_61::extended_program_error());
    check_near("operand fall-through result", read_live_x(), 7.0, 1e-8);
    core_61::clear_mk61_program_boundary_hook();

    core_61::enable();
    core_61::clear_extended_program_banks();
    u8 call_with_prefix_operand[37] = {};
    for(u8& code : call_with_prefix_operand) code = 0x50;
    call_with_prefix_operand[0] = 0x53;
    call_with_prefix_operand[1] = operand;
    call_with_prefix_operand[2] = 0x07;
    call_with_prefix_operand[target] = 0x08;
    call_with_prefix_operand[target + 1U] = 0x52;
    probe = {};
    check_true("CALL operand hook installed",
        core_61::set_mk61_program_boundary_hook(
            &program_boundary_probe, &probe));
    run_program(call_with_prefix_operand, sizeof(call_with_prefix_operand));
    check_true("1F/2F CALL operand retains ROM address",
        probe.calls == 5 &&
        probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
        probe.addresses[1] == target && probe.opcodes[1] == 0x08 &&
        probe.addresses[2] == target + 1U && probe.opcodes[2] == 0x52 &&
        probe.addresses[3] == 2 && probe.opcodes[3] == 0x07 &&
        probe.addresses[4] == 3 && probe.opcodes[4] == 0x50 &&
        !core_61::extended_program_error());
    core_61::clear_mk61_program_boundary_hook();
  }
  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 jump[] = {0x1F, 0x51, 0x02, 0x50, 0x50};
  check_true("write far bank", core_61::write_absolute_program(250, 0x07) &&
      core_61::write_absolute_program(251, 0x50));
  run_program(jump, sizeof(jump));
  check_true("far jump reaches bank 2", core_61::active_program_bank() == 2);
  check_near("far jump result", read_live_x(), 7.0, 1e-8);
  check_true("far jump no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 highest_opcode = 0;
  bool empty_banks_are_zero = true;
  for(u16 address = core_61::MAX_PROGRAM_STEP;
      address < core_61::EXTENDED_ADDRESS_LIMIT; ++address) {
    u8 value = 0xFF;
    if(!core_61::read_absolute_program(address, value) || value != 0)
      empty_banks_are_zero = false;
  }
  check_true("unallocated banks read as zeros without allocating slots",
      empty_banks_are_zero);
  check_true("highest absolute address is writable",
      core_61::write_absolute_program(9999, 0x07) &&
      core_61::write_absolute_program(9970, 0xFF) &&
      core_61::read_absolute_program(9999, highest_opcode) &&
      highest_opcode == 0x07);
  core_61::clear_extended_program_banks();
  check_true("clear releases distant bank storage",
      core_61::read_absolute_program(9999, highest_opcode) &&
      highest_opcode == 0x00 &&
      core_61::write_absolute_program(9999, 0x08));
  bool reused_bank_is_zero = true;
  for(u16 address = 9968; address < 9999; ++address) {
    u8 value = 0xFF;
    if(!core_61::read_absolute_program(address, value) || value != 0)
      reused_bank_is_zero = false;
  }
  check_true("reused bank storage keeps unwritten bytes zero", reused_bank_is_zero);
  check_true("partial bank write leaves both neighbours zero",
      core_61::write_absolute_program(250, 0x07) &&
      core_61::read_absolute_program(249, highest_opcode) && highest_opcode == 0 &&
      core_61::read_absolute_program(251, highest_opcode) && highest_opcode == 0);

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 populated_far_banks = 0;
  for(u16 bank = 1; bank <= 31; ++bank) {
    if(core_61::write_absolute_program(
           (u16) (bank * core_61::MAX_PROGRAM_STEP), 0x07) &&
        core_61::write_absolute_program(
           (u16) (bank * core_61::MAX_PROGRAM_STEP + 1), 0x50))
      populated_far_banks++;
  }
  check_true("32 bank slots include active bank",
      populated_far_banks == 31 &&
      !core_61::write_absolute_program(
          (u16) (32U * core_61::MAX_PROGRAM_STEP), 0x07));
  const u8 full_pool_jump[] = {0x1F, 0x51, 0x34, 0x72, 0x50};
  run_program(full_pool_jump, sizeof(full_pool_jump));
  check_true("full bank pool still runs populated bank",
      core_61::active_program_bank() == 31 &&
      !core_61::extended_program_error());
  check_near("full bank pool result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 edge_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize index = 0; index < core_61::MAX_PROGRAM_STEP; ++index)
    edge_page[index] = 0x50;
  edge_page[110] = 0x1F;
  edge_page[111] = 0x51;
  core_61::set_code_page(edge_page);
  check_true("write cross-bank prefix operands",
      core_61::write_absolute_program(112, 0x02) &&
      core_61::write_absolute_program(113, 0x50) &&
      core_61::write_absolute_program(250, 0x07) &&
      core_61::write_absolute_program(251, 0x50));
  core_61::set_IP(110);
  press_matrix({2, 9});
  for(int index = 0; index < 256 && core_61::is_RUN(); ++index)
    core_61::step();
  check_true("far prefix crosses 112-byte boundary",
      core_61::active_program_bank() == 2 &&
      !core_61::extended_program_error());
  check_near("cross-bank far result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  check_true("write bank-local K2",
      core_61::write_absolute_program(224, 0x56) &&
      core_61::write_absolute_program(225, 0x01));
  set_ms_program_byte(0, 0x54);
  set_ms_program_byte(1, 0x50);
  const u8 bank_exchange[] = {0x1F, 0x51, 0x02, 0x24, 0x50};
  run_program(bank_exchange, sizeof(bank_exchange));
  u8 bank_code = 0;
  u8 root_code = 0;
  check_true("K2 exchanges current far bank",
      core_61::active_program_bank() == 2 &&
      core_61::read_absolute_program(224, bank_code) &&
      core_61::read_absolute_program(0, root_code) &&
      bank_code == 0x54 && root_code == 0x1F &&
      get_ms_program_byte(0) == 0x56);

  core_61::set_expanded_program_mode(true);
  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 call[] = {0x1F, 0x53, 0x01, 0x20, 0x50};
  check_true("write far subroutine", core_61::write_absolute_program(120, 0x07) &&
      core_61::write_absolute_program(121, 0x52));
  run_program(call, sizeof(call));
  check_true("far return reaches bank 0", core_61::active_program_bank() == 0);
  check_near("far call result", read_live_x(), 7.0, 1e-8);
  check_true("far call no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  check_true("write mixed near/far calls",
      core_61::write_absolute_program(112, 0x53) &&
      core_61::write_absolute_program(113, 0x10) &&
      core_61::write_absolute_program(114, 0x52) &&
      core_61::write_absolute_program(122, 0x07) &&
      core_61::write_absolute_program(123, 0x52));
  const u8 mixed_calls[] = {0x1F, 0x53, 0x01, 0x12, 0x50};
  run_program(mixed_calls, sizeof(mixed_calls));
  check_true("mixed near/far returns unwind",
      core_61::active_program_bank() == 0 &&
      !core_61::extended_program_error());
  check_near("mixed calls result", read_live_x(), 7.0, 1e-8);

