bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  // Ten levels cross more banks than the original calculator's return stack
  // can hold; every ordinary RET must return after the entire 1F sequence.
  core_61::enable();
  core_61::clear_extended_program_banks();
  for(u16 bank = 1; bank <= 10; ++bank) {
    const u16 address = (u16) (bank * core_61::MAX_PROGRAM_STEP);
    if(bank == 10) {
      check_true("write deepest subroutine",
          core_61::write_absolute_program(address, 0x07) &&
          core_61::write_absolute_program((u16) (address + 1U), 0x52));
      continue;
    }
    const u16 target = (u16) ((bank + 1U) * core_61::MAX_PROGRAM_STEP);
    const u8 high = (u8) (((target / 1000U) << 4) | ((target / 100U) % 10U));
    const u8 low = (u8) ((((target / 10U) % 10U) << 4) | (target % 10U));
    check_true("write nested far subroutine",
        core_61::write_absolute_program(address, 0x1F) &&
        core_61::write_absolute_program((u16) (address + 1U), 0x53) &&
        core_61::write_absolute_program((u16) (address + 2U), high) &&
        core_61::write_absolute_program((u16) (address + 3U), low) &&
        core_61::write_absolute_program((u16) (address + 4U), 0x52));
  }
  const u8 deep_call[] = {0x1F, 0x53, 0x01, 0x12, 0x50};
  run_program(deep_call, sizeof(deep_call));
  check_true("nested far calls unwind to bank 0",
      core_61::active_program_bank() == 0 && !core_61::extended_program_error());
  check_near("nested far call result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 conditional[] = {0x1F, 0x57, 0x02, 0x50, 0x50};
  check_true("write far conditional target",
      core_61::write_absolute_program(250, 0x50));
  set_x_bcd(0x00000001U);
  run_program(conditional, sizeof(conditional));
  check_true("far x!=0 continues", core_61::active_program_bank() == 0);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000000U);
  run_program(conditional, sizeof(conditional));
  check_true("far x!=0 takes operand on zero",
      core_61::active_program_bank() == 2);

  core_61::enable();
  core_61::clear_extended_program_banks();
  char address_mantissa[8] = {'2','5','0','0','0','0','0','0'};
  write_stack_register(stack::X, ' ', address_mantissa, 2);
  press_matrix({6, 9}); // X -> R
  press_matrix(digit_key(0));
  check_near("far indirect register input", read_live_x(), 250.0, 1e-8);
  check_true("write far indirect target",
      core_61::write_absolute_program(249, 0x07) &&
      core_61::write_absolute_program(250, 0x50));
  const u8 indirect[] = {0x1F, 0x80, 0x50};
  run_program(indirect, sizeof(indirect));
  check_true("far indirect reaches bank 2",
      core_61::active_program_bank() == 2 && !core_61::extended_program_error());
  check_near("far indirect result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  const u8 display[] = {0x2F, 0x01, 0x2F, 0x2A, 0x2F, 0x0E, 0x50};
  run_program(display, sizeof(display));
  const u8* frame = core_61::segment_display_frame();
  check_true("segment mode active", frame != nullptr);
  check_true("segment strobe stores X", frame != nullptr && frame[1] == 7);
  check_true("segment strobe advances", core_61::extended_display_cursor() == 2);
  check_near("segment strobe leaves X", read_live_x(), 7.0, 1e-8);
  check_true("segment command no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  const char mask_mantissa[8] = {'2','5','5','0','0','0','0','0'};
  write_stack_register(stack::X, ' ', mask_mantissa, 2);
  const u8 sign_segments[] = {0x2F, 0x2A, 0x2F, 0x0E, 0x50};
  run_program(sign_segments, sizeof(sign_segments));
  frame = core_61::segment_display_frame();
  check_true("sign position accepts all eight segment bits",
      frame != nullptr && frame[0] == 0xFF &&
      core_61::extended_display_cursor() == 1 &&
      !core_61::extended_program_error());
  check_near("sign mask leaves X", read_live_x(), 255.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  run_program(display, sizeof(display));
  core_61::ContextBuffer display_snapshot = {};
  check_true("save segmented display context",
      core_61::save_context(display_snapshot));
  core_61::enable();
  check_true("restore segmented display context",
      core_61::restore_context(display_snapshot));
  frame = core_61::segment_display_frame();
  check_true("segment frame survives context lease",
      frame != nullptr && frame[1] == 7 &&
      core_61::extended_display_cursor() == 2);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 automatic[] = {0x2F, 0x01, 0x2F, 0x2A, 0x07, 0x50};
  run_program(automatic, sizeof(automatic));
  frame = core_61::segment_display_frame();
  check_true("segment auto follows X", frame != nullptr && frame[1] == 7);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 held[] = {0x2F, 0x01, 0x2F, 0x2A, 0x2F, 0x50, 0x07, 0x50};
  run_program(held, sizeof(held));
  frame = core_61::segment_display_frame();
  check_true("segment hold ignores later X", frame != nullptr && frame[1] == 0);
  check_near("hold leaves arithmetic X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 numeric_strobe[] = {0x2F, 0x50, 0x07, 0x2F, 0x0E, 0x50};
  run_program(numeric_strobe, sizeof(numeric_strobe));
  char indicator[INDICATOR_STRING_LENGTH] = {};
  (void) core_61::update_indicator(indicator, SYMBOLS);
  check_true("numeric hold strobe publishes X",
      !core_61::extended_display_auto() && std::strchr(indicator, '7') != nullptr);
  check_near("numeric strobe leaves X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 clear_segments[] = {
      0x2F, 0x01, 0x2F, 0x2A, 0x07, 0x2F, 0x0D, 0x50};
  run_program(clear_segments, sizeof(clear_segments));
  frame = core_61::segment_display_frame();
  bool all_blank = frame != nullptr;
  for(u8 index = 0; frame != nullptr && index < 12; ++index)
    all_blank &= frame[index] == 0;
  check_true("segment clear stays blank",
      all_blank && !core_61::extended_display_auto());
  check_near("segment clear leaves X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 clear_and_resume[] = {
      0x2F, 0x50, 0x2F, 0x0D, 0x2F, 0x52, 0x07, 0x50};
  run_program(clear_and_resume, sizeof(clear_and_resume));
  check_true("numeric display resumes", core_61::extended_display_auto());
  check_near("resume follows X", read_live_x(), 7.0, 1e-8);
}

static void test_extended_opcode_matrix(void) {
  std::printf("expanded 1F/2F opcode matrix:\n");
  core_61::set_expanded_program_mode(true);
  static const u8 indirect_families[] = {
      0x70, 0x80, 0x90, 0xA0, 0xC0, 0xE0};
  const char one[8] = {'1','0','0','0','0','0','0','0'};
  const char zero[8] = {'0','0','0','0','0','0','0','0'};
  for(u8 family : indirect_families) {
    const bool conditional = family == 0x70 || family == 0x90 ||
                             family == 0xC0 || family == 0xE0;
    for(u8 reg = 0; reg < 16; ++reg) {
      const u8 opcode = (u8) (family | reg);
      const u16 initial = reg <= 3 ? 251U : reg <= 6 ? 249U : 250U;
      for(u8 path = 0; path < (conditional ? 2U : 1U); ++path) {
        core_61::enable();
        core_61::clear_extended_program_banks();
        set_register_integer(reg, initial);
        // A conditional indirect opcode takes its register address only when
        // the native predicate is false. Exercise both paths for every Rn.
        const bool take_target = path == 0;
        const bool negative = family == 0x90 ? take_target :
                              family == 0xC0 ? !take_target : false;
        const bool x_is_zero = family == 0x70 ? take_target :
                               family == 0xE0 ? !take_target : false;
        write_stack_register(stack::X, negative ? '-' : ' ',
                             x_is_zero ? zero : one, 0);
        const bool wrote = core_61::write_absolute_program(250, 0x07) &&
            core_61::write_absolute_program(251,
                family == 0xA0 ? 0x52 : 0x50);
        const u8 program[] = {0x1F, opcode, 0x08, 0x50};
        if(wrote) run_program(program, sizeof(program));
        const bool returned = family == 0xA0 ||
                              (conditional && !take_target);
        const u16 expected_reg = take_target ? 250U : initial;
        const bool ok = wrote && core_61::is_CALC() &&
            !core_61::extended_program_error() &&
            core_61::active_program_bank() == (returned ? 0U : 2U) &&
            std::fabs(read_register_decimal(reg) - expected_reg) < 1e-7 &&
            std::fabs(read_live_x() - (returned ? 8.0 : 7.0)) < 1e-7;
        if(!ok) {
          std::printf("  FAIL 1F %02X %s: bank=%u X=%.8g R%X=%.8g error=%d\n",
              opcode, take_target ? "taken" : "fallthrough",
              core_61::active_program_bank(), read_live_x(), reg,
              read_register_decimal(reg), core_61::extended_program_error());
          g_failures++;
        }
      }
    }
  }
  std::printf("  checked all 96 indirect opcodes and 64 conditional fallthroughs\n");

  const char mask[8] = {'2','5','5','0','0','0','0','0'};
  for(u8 position = 0; position < 12; ++position) {
    core_61::enable();
    core_61::clear_extended_program_banks();
    write_stack_register(stack::X, ' ', mask, 2);
    const u8 program[] = {0x2F, 0x50, 0x2F, position,
                          0x2F, 0x2A, 0x2F, 0x0E, 0x50};
    run_program(program, sizeof(program));
    const u8* frame = core_61::segment_display_frame();
    bool correct = frame != nullptr &&
        core_61::extended_display_cursor() == (position + 1U) % 12U &&
        !core_61::extended_program_error();
    for(u8 index = 0; frame != nullptr && index < 12; ++index)
      correct &= frame[index] == (index == position ? 0xFFU : 0U);
    char label[64] = {};
    std::snprintf(label, sizeof(label), "2F position %02X accepts mask FF", position);
    check_true(label, correct);
  }

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  const u8 rotate[] = {0x2F, 0x50, 0x2F, 0x2A, 0x2F, 0x25,
                       0x2F, 0x0E, 0x50};
  run_program(rotate, sizeof(rotate));
  const u8* frame = core_61::segment_display_frame();
  check_true("2F 25 rotates without drawing",
      frame != nullptr && frame[0] == 0 && frame[1] == 7 &&
      core_61::extended_display_cursor() == 2 &&
      !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  const u8 numeric_view[] = {0x2F, 0x50, 0x2F, 0x2A,
                             0x2F, 0x0E, 0x2F, 0x30, 0x50};
  run_program(numeric_view, sizeof(numeric_view));
  check_true("2F 30 restores numeric view",
      core_61::segment_display_frame() == nullptr &&
      !core_61::extended_display_segmented() &&
      !core_61::extended_program_error());

  const u8 unsupported_prefixes[] = {0x1F, 0x2F};
  for(const u8 bad_prefix : unsupported_prefixes) {
    core_61::enable();
    core_61::clear_extended_program_banks();
    const u8 invalid[] = {bad_prefix,
        (u8) (bad_prefix == 0x1F ? 0x2F : 0x0C), 0x50};
    run_program(invalid, sizeof(invalid));
    check_true("unsupported prefix subcode stops with error",
        core_61::is_CALC() && core_61::extended_program_error());
  }
}

static void test_packed_segment_frames(void) {
  std::printf("packed segment frames and register formatting:\n");
  core_61::set_expanded_program_mode(true);
  const u8 publish[] = {0x2F,0x50,0x2F,0x2A,0x2F,0x53,0x50};
  const u8 publish_again[] = {0x2F,0x53,0x50};
  const u8 masks[12] = {0,255,128,1,2,4,8,16,32,64,57,55};
  core_61::enable();
  core_61::clear_extended_program_banks();
  for(u8 r=0;r<4;++r)
    set_register_integer(r, masks[r*3] | (u32(masks[r*3+1])<<8) |
                             (u32(masks[r*3+2])<<16));
  set_x_bcd(0x00000007U);
  run_program(publish,sizeof(publish));
  check_true("packed publish includes dots and sign positions",
      !core_61::extended_program_error() &&
      std::memcmp(core_61::segment_display_frame(),masks,12)==0);
  const u32 revision=core_61::extended_display_revision();
  run_program(publish_again,sizeof(publish_again));
  check_true("identical frame does not redraw",
      revision==core_61::extended_display_revision());
  check_near("packed publish preserves X",read_live_x(),7,0);
  set_register_integer(3,0x1000000U);
  run_program(publish_again,sizeof(publish_again));
  check_true("invalid last word leaves entire frame intact",
      core_61::extended_program_error() &&
      revision==core_61::extended_display_revision() &&
      std::memcmp(core_61::segment_display_frame(),masks,12)==0);

  // Cover every source register, including aliases of the four destination
  // words, cursor wrapping, leading zeroes, and the full eight-digit range.
  const u8 decimal_masks[10]={63,6,91,79,102,109,125,7,127,111};
  const u32 values[3]={0,1234567,99999999};
  for(u8 r=0;r<16;++r) for(u32 value:values) {
    // Aliases must also be valid packed words before formatting.
    if(r<4 && value>=0x1000000U) continue;
    core_61::enable();
    core_61::clear_extended_program_banks();
    for(u8 w=0;w<4;++w)set_register_integer(w,0);
    set_register_integer(r,value);
    u8 expected[12]={};
    if(r<4) for(u8 b=0;b<3;++b)expected[r*3+b]=u8(value>>(8*b));
    u32 digits=value;
    for(int i=7;i>=0;--i) {expected[(10+i)%12]=decimal_masks[digits%10];digits/=10;}
    set_x_bcd(0x00000007U);
    const u8 format[]={0x2F,0x50,0x2F,0x2A,0x2F,0x0A,0x2F,u8(0x60+r),0x50};
    run_program(format,sizeof(format));
    const u8 blank[12]={};
    check_true("decimal formatting stays off-screen",
        !core_61::extended_program_error() &&
        std::memcmp(core_61::segment_display_frame(),blank,12)==0 &&
        core_61::extended_display_cursor()==6);
    run_program(publish_again,sizeof(publish_again));
    check_true("decimal register frame matches independent digits",
        std::memcmp(core_61::segment_display_frame(),expected,12)==0);
    check_near("decimal formatting preserves X",read_live_x(),7,0);
  }

  // A nonstandard alphabet with dots, spanning a program-bank boundary.
  const u8 alphabet[16]={0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,
                         0xF8,0xF9,0xFA,0xFB,0xFC,0xFD,0xFE,0xFF};
  const u32 hex_values[]={0U,0x012345U,0x6789ABU,0xCDEF01U,0xFFFFFFU};
  for(u32 value:hex_values) {
    core_61::enable();
    core_61::clear_extended_program_banks();
    for(u8 w=0;w<4;++w)set_register_integer(w,0);
    for(u8 i=0;i<16;++i)core_61::write_absolute_program(218+i,alphabet[i]);
    set_register_integer(0xC,value);set_register_integer(0xF,218);
    const u8 format[]={0x2F,0x50,0x2F,0x2A,0x2F,0x7C,0x2F,0x53,0x50};
    run_program(format,sizeof(format));
    u8 expected[12]={};
    for(int i=5;i>=0;--i) {expected[i]=alphabet[value%16];value/=16;}
    check_true("hex frame uses supplied alphabet across banks",
        !core_61::extended_program_error() &&
        std::memcmp(core_61::segment_display_frame(),expected,12)==0 &&
        core_61::extended_display_cursor()==6);
  }

