bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  char terminated[15];
  std::memset(terminated, 'X', sizeof(terminated));
  read_stack_register(stack::X, terminated, SYMBOLS);
  check_true("stack text terminated", terminated[14] == 0);

  for(int expanded = 0; expanded <= 1; expanded++) {
    core_61::set_expanded_program_mode(expanded != 0);
    core_61::enable();
    u8 input[core_61::CODE_PAGE_BUFFER_SIZE] = {};
    u8 output[core_61::CODE_PAGE_BUFFER_SIZE] = {};
    for(usize i = 0; i < core_61::program_steps(); i++) input[i] = (u8) ((i * 37u + 11u) & 0xFFu);
    core_61::set_code_page(input);
    core_61::get_code_page(output);
    check_true(expanded ? "expanded code page" : "classic code page",
      std::memcmp(input, output, core_61::program_steps()) == 0);
  }

  core_61::set_expanded_program_mode(true);
  core_61::enable();
  ringM[15 * 42 + 21] = 7;
  check_true("R_F seeded", MK61Emu_Read_R_mantissa(15) != 0);
  core_61::clear_memory_registers();
  check_true("R_F cleared", MK61Emu_Read_R_mantissa(15) == 0);
}

static void test_program_boundary_yield(void) {
  std::printf("program command boundary yield:\n");
  core_61::clear_mk61_program_boundary_hook();
  core_61::set_expanded_program_mode(false);
  core_61::enable();

  u8 page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x01;
  page[1] = 0x02;
  page[2] = 0x50;
  core_61::set_code_page(page);
  core_61::set_IP(0);

  ProgramBoundaryProbe probe = {};
  probe.target = 0;
  probe.yield = true;
  check_true("boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  check_true("second boundary hook rejected",
      !core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));

  press_matrix({2, 9}); // C/P
  for(int i = 0; i < 32 && probe.calls == 0; i++) core_61::step();
  check_true("yielded before address 0",
      probe.calls > 0 && probe.last_address == 0 &&
      probe.last_opcode == 0x01 && core_61::program_boundary_yielded());

  const int repeated_before = probe.calls;
  core_61::step();
  check_true("same boundary repeats until resumed",
      probe.calls == repeated_before + 1 && probe.last_address == 0 &&
      probe.last_opcode == 0x01 && core_61::program_boundary_yielded());

  probe.target = 1;
  const int next_before = probe.calls;
  core_61::step();
  check_true("resume reaches following command",
      probe.calls > next_before && probe.last_address == 1 &&
      probe.last_opcode == 0x02 && core_61::program_boundary_yielded());

  core_61::ContextBuffer saved = {};
  check_true("caller context saved", core_61::save_context(saved));
  const i32 saved_ip = core_61::get_IP();
  set_x_bcd(0x12345678U);
  core_61::set_IP(17);
  check_true("caller context restored", core_61::restore_context(saved));
  check_true("boundary IP restored", core_61::get_IP() == saved_ip);

  core_61::clear_mk61_program_boundary_hook();
  check_true("boundary yield flag cleared",
      !core_61::program_boundary_yielded());
  for(int i = 0; i < 64 && core_61::is_RUN(); i++) core_61::step();
  check_true("program finishes after hook removal", core_61::is_CALC());

  // Адрес ловушки указывает на байт кода. Операнд двухбайтового перехода
  // используется внутри и не должен появляться как отдельная граница команды.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x51; // БП / JMP
  page[1] = 0x02; // операнд назначения
  page[2] = 0x50;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  probe.target = 0;
  probe.yield = true;
  check_true("two-byte boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  check_true("two-byte opcode boundary",
      probe.calls > 0 && probe.last_address == 0 &&
      probe.last_opcode == 0x51 && core_61::program_boundary_yielded());
  probe.target = 2;
  core_61::step();
  check_true("two-byte operand is not a boundary",
      probe.last_address == 2 && probe.last_opcode == 0x50 &&
      core_61::program_boundary_yielded());
  core_61::clear_mk61_program_boundary_hook();

  // CALL использует другой путь ПЗУ и действительно показывает последовательный
  // операнд по общему микроадресу предварительной выборки. Но результатом должны
  // быть только настоящие границы кодов: CALL 95, RET по 95, затем HLT по 2.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x53; // ПП / CALL
  page[1] = 0x95; // операнд назначения в том виде, как он введён на калькуляторе
  page[2] = 0x50;
  page[95] = 0x52;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  check_true("CALL boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  for(int i = 0; i < 256 && core_61::is_RUN(); i++) core_61::step();
  check_true("CALL operand is not a boundary",
      probe.calls == 3 &&
      probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
      probe.addresses[1] == 95 && probe.opcodes[1] == 0x52 &&
      probe.addresses[2] == 2 && probe.opcodes[2] == 0x50);
  check_true("CALL program finishes", core_61::is_CALC());
  core_61::clear_mk61_program_boundary_hook();

  // Вложенные вызовы тоже дважды показывают оба операнда; подавление должно
  // следовать стеку возвратов калькулятора, а не помнить лишь последний CALL.
  core_61::enable();
  for(usize i = 0; i < core_61::program_steps(); i++) page[i] = 0x50;
  page[0] = 0x53;
  page[1] = 0x90;
  page[2] = 0x50;
  page[90] = 0x53;
  page[91] = 0x95;
  page[92] = 0x52;
  page[95] = 0x52;
  core_61::set_code_page(page);
  core_61::set_IP(0);
  probe = {};
  check_true("nested CALL boundary hook installed",
      core_61::set_mk61_program_boundary_hook(
          &program_boundary_probe, &probe));
  press_matrix({2, 9});
  for(int i = 0; i < 512 && core_61::is_RUN(); i++) core_61::step();
  check_true("nested CALL operands are not boundaries",
      probe.calls == 5 &&
      probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
      probe.addresses[1] == 90 && probe.opcodes[1] == 0x53 &&
      probe.addresses[2] == 95 && probe.opcodes[2] == 0x52 &&
      probe.addresses[3] == 92 && probe.opcodes[3] == 0x52 &&
      probe.addresses[4] == 2 && probe.opcodes[4] == 0x50);
  check_true("nested CALL program finishes", core_61::is_CALC());
  core_61::clear_mk61_program_boundary_hook();
}

