bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
static void test_save_restore(void) {
  std::printf("core context save/restore isolation:\n");
  core_61::enable();
  MK61Emu_SetAngleUnit(DEGREE);
  core_61::edit_program = true;

  // Заполняем весь стек различающимися значениями.
  char mX[8] = {'1','2','3','4','5','0','0','0'}; write_stack_register(stack::X, ' ', mX, 2); // 123.45
  char mY[8] = {'6','7','8','9','0','0','0','0'}; write_stack_register(stack::Y, '-', mY, 0); // -6.789
  char mZ[8] = {'1','1','1','1','1','1','1','1'}; write_stack_register(stack::Z, ' ', mZ, 1); // 11.111111
  char mT[8] = {'9','8','7','6','5','4','3','2'}; write_stack_register(stack::T, ' ', mT, -3); // 0.0098765...

  const double bX = read_live_reg(stack::X);
  const double bY = read_live_reg(stack::Y);
  const double bZ = read_live_reg(stack::Z);
  const double bT = read_live_reg(stack::T);
  // X2 — защёлка экрана/дисплея, хранящаяся отдельно от стека X.
  char x2_before[24]; std::strncpy(x2_before, MK61Emu_GetIndicatorStr(SYMBOLS), sizeof(x2_before) - 1);
  x2_before[sizeof(x2_before) - 1] = 0;

  // Арендуем ядро для обычной операции и ошибки области определения (корня из
  // отрицательного числа, который фиксирует ЕГГОГ внутри аренды); ни одна из них
  // не должна проникнуть в рабочее состояние.
  (void) mk_math::sin(1.0);
  (void) mk_math::sqrt(-4.0);

  char x2_after[24]; std::strncpy(x2_after, MK61Emu_GetIndicatorStr(SYMBOLS), sizeof(x2_after) - 1);
  x2_after[sizeof(x2_after) - 1] = 0;

  check_true("angle preserved (DEGREE)", MK61Emu_GetAngleUnit() == DEGREE);
  check_true("edit mode preserved", core_61::edit_program);
  check_near("X preserved", read_live_reg(stack::X), bX, 1e-6);
  check_near("Y preserved", read_live_reg(stack::Y), bY, 1e-6);
  check_near("Z preserved", read_live_reg(stack::Z), bZ, 1e-6);
  check_near("T preserved", read_live_reg(stack::T), bT, 1e-6);
  check_true("X2/display preserved", std::strcmp(x2_before, x2_after) == 0);
}

static void test_context_slot_arbitration(void) {
  std::printf("core context slot arbitration:\n");
  core_61::ContextBuffer* trap = core_61::acquire_context_buffer(
      core_61::ContextBufferOwner::M61_TRAP);
  check_true("trap acquires shared slot", trap != nullptr);
  check_true("owned slot is stable",
      core_61::owned_context_buffer(
          core_61::ContextBufferOwner::M61_TRAP) == trap);
  check_true("math cannot overwrite trap",
      core_61::acquire_context_buffer(
          core_61::ContextBufferOwner::MATH_CORE) == nullptr);
  check_true("benchmark cannot overwrite trap",
      core_61::acquire_context_buffer(
          core_61::ContextBufferOwner::BENCHMARK) == nullptr);
  check_true("busy math fails without stealing slot",
      std::isnan(mk_math::sin(1.0)) &&
      core_61::owned_context_buffer(
          core_61::ContextBufferOwner::M61_TRAP) == trap);
  check_true("wrong owner cannot release trap",
      !core_61::release_context_buffer(
          core_61::ContextBufferOwner::MATH_CORE));
  check_true("trap releases shared slot",
      core_61::release_context_buffer(
          core_61::ContextBufferOwner::M61_TRAP));
  check_true("released slot has no owner",
      core_61::owned_context_buffer(
          core_61::ContextBufferOwner::M61_TRAP) == nullptr);
  core_61::ContextBuffer* benchmark = core_61::acquire_context_buffer(
      core_61::ContextBufferOwner::BENCHMARK);
  check_true("benchmark reuses released slot", benchmark == trap);
  check_true("benchmark releases shared slot",
      core_61::release_context_buffer(
          core_61::ContextBufferOwner::BENCHMARK));
}

#if MK61_CORE_HOT_TABLES_IN_SRAM > 0
static void test_hot_table_cache_eviction(void) {
  std::printf("core hot-table cache eviction:\n");
  shared_memory::reset_statistics();
  core_61::reset_hot_table_cache_statistics();
  core_61::enable();

  core_61::HotTableCacheSnapshot cache =
      core_61::hot_table_cache_statistics();
  check_true("cache enabled and resident",
      cache.enabled && cache.level == MK61_CORE_HOT_TABLES_IN_SRAM &&
      cache.cached && cache.bytes <= shared_memory::WORKSPACE_SIZE);

  core_61::ContextBuffer start = {};
  core_61::ContextBuffer cached_result = {};
  core_61::ContextBuffer flash_result = {};
  check_true("cache test start saved", core_61::save_context(start));
  static constexpr int STEPS = 37;
  for(int step = 0; step < STEPS; step++) core_61::step();

  // Новый foreground-владелец должен синхронно переключить ядро на Flash,
  // а не получить BUSY и не оставить ни одного указателя в перезаписанной SRAM.
  shared_memory::Lease foreground(
      shared_memory::Arena::WORKSPACE,
      shared_memory::Owner::MARKDOWN_VIEWER,
      shared_memory::WORKSPACE_SIZE);
  check_true("foreground evicts core cache", foreground.ok());
  cache = core_61::hot_table_cache_statistics();
  check_true("cache reports eviction", !cache.cached && cache.evictions == 1);
  check_true("cached result saved after rebase",
      core_61::save_context(cached_result));

  check_true("start restored on Flash", core_61::restore_context(start));
  for(int step = 0; step < STEPS; step++) core_61::step();
  check_true("flash result saved", core_61::save_context(flash_result));
  check_true("SRAM and Flash execution are bit-identical",
      std::memcmp(cached_result.bytes, flash_result.bytes,
                  sizeof(cached_result.bytes)) == 0);
  cache = core_61::hot_table_cache_statistics();
  check_true("busy interval counted as Flash steps",
      cache.flash_steps == STEPS);

  foreground.reset();
  core_61::enable();
  cache = core_61::hot_table_cache_statistics();
  check_true("cache reloads after foreground release",
      cache.cached && cache.loads >= 2);
  const shared_memory::Snapshot workspace =
      shared_memory::snapshot(shared_memory::Arena::WORKSPACE);
  check_true("arena records one successful reclaim",
      workspace.reclaim_attempts == 1 && workspace.reclaims == 1 &&
      workspace.reclaim_failures == 0);

  // Returning from a language to the calculator must not leave the core on
  // Flash forever. The complete inactive runtime is first stashed in BULK;
  // only then may the optional table cache replace its resident workspace.
  workspace_swap::discard();
  {
    language_workspace::Lease focal(
        language_workspace::Owner::FOCAL, 512);
    check_true("language evicts table cache", focal.ok() && focal.fresh());
    if(focal.ok()) {
      std::memset(focal.data(), 0, focal.size());
      ((u8*) focal.data())[0] = 0x61;
      ((u8*) focal.data())[511] = 0x5A;
    }
  }
  core_61::enable();
  cache = core_61::hot_table_cache_statistics();
  const workspace_swap::Statistics swap = workspace_swap::statistics();
  check_true("calculator stashes language and reloads cache",
      cache.cached && swap.valid &&
      swap.owner == shared_memory::Owner::FOCAL && swap.raw_size == 512);
  {
    language_workspace::Lease focal(
        language_workspace::Owner::FOCAL, 512);
    check_true("language restores after table-cache eviction",
        focal.ok() && !focal.fresh() &&
        ((const u8*) focal.data())[0] == 0x61 &&
        ((const u8*) focal.data())[511] == 0x5A);
  }
}
#endif

#if MK61_CORE_NATIVE_HOT_PATHS
static bool compare_native_steps(const char* label, bool expanded) {
  core_61::set_expanded_program_mode(expanded);
  core_61::set_native_hot_paths_enabled(false);
  core_61::enable();

  core_61::ContextBuffer start = {};
  core_61::ContextBuffer reference = {};
  core_61::ContextBuffer native = {};
  static const MatrixKey keys[] = {
    {4, 1},   // 2
    {11, 8},  // ENTER
    {5, 1},   // 3
    {2, 8},   // +
    {10, 9},  // K
    {11, 8}   // K-function continuation
  };

  for(usize iteration = 0; iteration < 160; iteration++) {
    const usize phase = iteration %
        (sizeof(keys) / sizeof(keys[0]) * 8U);
    if((phase & 7U) < 4U) {
      const MatrixKey key = keys[phase / 8U];
      MK61Emu_SetKeyPress(key.x, key.y);
    } else {
      MK61Emu_SetKeyPress(0, 0);
    }

    if(!core_61::save_context(start)) {
      std::printf("  FAIL %s: cannot save start at step %lu\n",
          label, (unsigned long) iteration);
      return false;
    }

