bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
    core_61::set_native_hot_paths_enabled(false);
    core_61::step();
    if(!core_61::save_context(reference)) {
      std::printf("  FAIL %s: cannot save reference at step %lu\n",
          label, (unsigned long) iteration);
      return false;
    }

    if(!core_61::restore_context(start)) {
      std::printf("  FAIL %s: cannot restore start at step %lu\n",
          label, (unsigned long) iteration);
      return false;
    }
    core_61::set_native_hot_paths_enabled(true);
    core_61::step();
    if(!core_61::save_context(native)) {
      std::printf("  FAIL %s: cannot save native state at step %lu\n",
          label, (unsigned long) iteration);
      return false;
    }

    if(std::memcmp(reference.bytes, native.bytes,
                   sizeof(reference.bytes)) != 0) {
      usize offset = 0;
      while(offset < sizeof(reference.bytes) &&
            reference.bytes[offset] == native.bytes[offset]) offset++;
      std::printf(
          "  FAIL %s: state differs at step %lu byte %lu (%02X != %02X)\n",
          label, (unsigned long) iteration, (unsigned long) offset,
          (unsigned) reference.bytes[offset], (unsigned) native.bytes[offset]);
      return false;
    }

    // Continue from the reference timeline so every comparison starts from a
    // state produced exclusively by the original bit-serial decoder.
    if(!core_61::restore_context(reference)) {
      std::printf("  FAIL %s: cannot continue reference at step %lu\n",
          label, (unsigned long) iteration);
      return false;
    }
  }
  return true;
}

static void test_native_hot_paths(void) {
  std::printf("native microprogram hot paths vs bit-serial reference:\n");
  core_61::reset_native_hot_path_counts();
  check_true("classic full-state differential",
      compare_native_steps("classic", false));
  check_true("expanded full-state differential",
      compare_native_steps("expanded", true));
  check_true("IK06 r1 body 00 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_ZERO_REGION1) > 0);
  check_true("IK06 r2 body 00 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_ZERO_REGION2) > 0);
  check_true("IK06 r3 body 06 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_ADD_S_REGION3) > 0);
  check_true("IK06 r3 body 07 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_ADVANCE_REGION3) > 0);
  check_true("IK06 r3 body 09 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_RESET_REGION3) > 0);
  check_true("IK06 r1 wait body 40 exercised",
      core_61::native_hot_path_count(
          core_61::NativeHotPath::IK1306_WAIT_REGION1) > 0);
  core_61::set_native_hot_paths_enabled(true);
}
#endif

#if MK61_CORE_PACKED_AMK
static bool compare_packed_amk_steps(const char* label, bool expanded) {
  core_61::set_expanded_program_mode(expanded);
  core_61::set_packed_amk_enabled(false);
  core_61::enable();

  core_61::ContextBuffer start = {};
  core_61::ContextBuffer reference = {};
  core_61::ContextBuffer packed = {};
  static const MatrixKey keys[] = {
    {4, 1}, {11, 8}, {5, 1}, {2, 8}, {10, 9}, {11, 8}
  };

  for(usize iteration = 0; iteration < 160; iteration++) {
    const usize phase = iteration %
        (sizeof(keys) / sizeof(keys[0]) * 8U);
    if((phase & 7U) < 4U) {
      const MatrixKey key = keys[phase / 8U];
      MK61Emu_SetKeyPress(key.x, key.y);
    } else {
      MK61Emu_SetKeyPress(0, 0);
    }

    if(!core_61::save_context(start)) return false;
    core_61::set_packed_amk_enabled(false);
    core_61::step();
    if(!core_61::save_context(reference) ||
       !core_61::restore_context(start)) return false;

    core_61::set_packed_amk_enabled(true);
    core_61::step();
    if(!core_61::save_context(packed)) return false;
    if(std::memcmp(reference.bytes, packed.bytes,
                   sizeof(reference.bytes)) != 0) {
      usize offset = 0;
      while(offset < sizeof(reference.bytes) &&
            reference.bytes[offset] == packed.bytes[offset]) offset++;
      std::printf(
          "  FAIL %s: packed AMK differs at step %lu byte %lu "
          "(%02X != %02X)\n",
          label, (unsigned long) iteration, (unsigned long) offset,
          (unsigned) reference.bytes[offset], (unsigned) packed.bytes[offset]);
      return false;
    }
    if(!core_61::restore_context(reference)) return false;
  }
  return true;
}

static void test_packed_amk(void) {
  std::printf("packed AMK selector vs scalar full state:\n");
  check_true("classic packed-AMK differential",
      compare_packed_amk_steps("classic", false));
  check_true("expanded packed-AMK differential",
      compare_packed_amk_steps("expanded", true));
  core_61::set_packed_amk_enabled(true);
}
#endif

int main(void) {
#if MK61_CORE_HOT_TABLES_IN_SRAM > 0
  test_hot_table_cache_eviction();
#endif
#if MK61_CORE_BODY_PROFILE
  core_61::reset_body_profile();
#endif
  test_pure_helpers();
  test_transcendental();
  test_authentic_core_smoke();
  test_extended_prefixes();
  test_virtual_return_x2();
  test_virtual_call_rom_addressing();
  test_far_condition_writeback();
  test_extended_opcode_matrix();
  test_packed_segment_frames();
  test_rom_command_hooks();
  test_mk61_command_lengths();
  test_mk61_command_hooks();
  test_ms_exchange_commands();
  test_random_seed_hook();
  test_program_boundary_yield();
  test_core_boundaries();
  test_context_slot_arbitration();
  test_save_restore();

#if MK61_CORE_BODY_PROFILE
  dump_body_profile();
#endif
#if MK61_CORE_NATIVE_HOT_PATHS
  test_native_hot_paths();
#endif
#if MK61_CORE_PACKED_AMK
  test_packed_amk();
#endif

  if(g_failures == 0) {
    std::printf("mk_math_self_test: ok\n");
    return 0;
  }
  std::printf("mk_math_self_test: %d failure(s)\n", g_failures);
  return 1;
}
